In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [8]:
df = pd.read_csv('D:/DataScience/365_Learning_Challenge/365_database/365_student_info.csv')

In [10]:
f = {"No_of_students": 'count'}
students_per_country = df[['student_country','student_id']].groupby('student_country', as_index=False)['student_id'].agg(f)

In [11]:
students_per_country = pd.DataFrame(students_per_country)

In [12]:
students_per_country.head(10)

  student_country  No_of_students
0              AD               2
1              AE             250
2              AF               5
3              AG               1
4              AL              22
5              AM              22
6              AO              13
7              AR             149
8              AT              63
9              AU             446

In [21]:
## sorting the dataset by number of students
sorted_db = students_per_country.sort_values(by= 'No_of_students', axis=0, ascending=False, ignore_index= True)
sorted_db.head(10)
#students_per_country.columns.values

  student_country  No_of_students
0              IN            6933
1              US            4768
2              EG            3003
3              GB            1748
4              NG            1718
5              CA            1180
6              DE             982
7              PK             718
8              ID             589
9              SA             565

In [23]:
sorted_db.to_csv('students_per_country', encoding='utf-8', index=False)